[{"id":3987952,"title":"Court allows DPP to review DP Gachagua’s Sh7.4bn graft case","excerpt":"Court allows DPP to review DP Gachagua’s Sh7.4bn graft case","body":"<p>The anti-corruption court in Nairobi has granted prosecutors three weeks to review the Sh7.4 billion graft charges against Deputy President Rigathi Gachagua and nine others.</p><p>Milimani anti-corruption magistrate Victor Wakumile allowed the Director of Public Prosecutions (DPP) request to postpone the hearing scheduled for Monday and Tuesday so that the prosecutors can review the case before giving directions on whether the trial of Mr Gachagua will proceed. </p><p>The DPP was granted until November 21 to return to court with directions for the trial. </p><p><em>More follows</em></p>","link":"https://nation.africa/kenya/news/court-allows-dpp-to-review-dp-gachagua-s-sh7-4bn-graft-case-3987952","slug":"Court-allows-DPP-to-review-DP-Gachagua's-Sh7.4bn-graft-case","date":"2022-10-17T09:06:41Z","articleDate":"17 Oct, 2022","timeAgo":"3 minutes ago","tags":["Nairobi"," Court"," Free"," dpp","Noordin","Noordin Haji"],"photo":"https://nation.africa/resource/blob/3987958/c53654d2a60506379a882f14484aa648/chagua-data.jpg","caption":"","video":"","author":[{"fullname":"Joseph Wangui","biography":"","link":"https://nation.africa/kenya/joseph-wangui-395672","photo":"https://nation.africa/resource/blob/1928544/af62e22eecbc6d197f146f6ef83692bc/whatsapp-image-2020-08-30-at-11-24-51-2--data.jpg"}]},{"id":3987900,"title":"UN Women, Pepfar promote young women's role in global HIV response","excerpt":"UN Women, Pepfar promote young women's role in global HIV response","body":"<p>African leaders converged in Tanzania to champion the role of young women in the global HIV response. The high-level meeting co-hosted by UN Women and the Government of Tanzania, affirmed that girls and women are disproportionately affected by HIV.</p><p>“Today launches an important new phase in women’s leadership in the effort against HIV/AIDS,” said Ms. Sima Bahous, Executive Director of UN Women. “It will ensure that the voices of women and girls of all ages who are disproportionately affected by HIV inform decision-making around the HIV response and that their needs are met.”</p><p>The meeting supported by US President’s Emergency Plan for AIDS Relief (PEPFAR) was held to mark the International Day of the Girl Child. During the meeting, it was revealed that in the 15 to 24 age group, girls are three times more likely to acquire HIV than boys in sub-Saharan Africa.</p><p>In 2021 alone, every two minutes an adolescent girl or young woman was newly infected with HIV – an estimated 4,900 new infections each week. </p><p>The meeting brought together emerging young women leaders, women ministers, and leaders in health, education, and gender equality from 15 countries where girls and young women experience disproportionately high rates of new HIV infections.</p><p>The disproportionate vulnerability was linked to, among others, persistent gender inequalities, stigma, and discrimination, gender-based violence, child marriage, and unpaid care work responsibilities, barriers to education and employment opportunities. Exacerbated by the COVID-19 pandemic, these factors were also hindering their access to HIV prevention and treatment services.</p><p>Speaking at the hybrid meeting, Tanzanian Minister of Health and Gender, Dorothy Gwajima urged leaders to mentor young women in order to build a future leadership which is strong. “We should open doors and invest in building their skills and confidence so they can make positive changes in their communities and countries,” she said. </p><p>The leaders also gave recommendations to address the alarming incidence of HIV. “To end the HIV/AIDS pandemic, we have to tackle inequities that leave adolescent girls and young women vulnerable,” said US Global AIDS Coordinator and Special Representative for Health Diplomacy Ambassador John Nkengasong, who oversees PEPFAR. Dr. Nkengasong added that PEPFAR, through its programmes like DREAMS would expand efforts to empower women and build partnerships at the community level which eliminate barriers that increase the risk of contracting HIV. </p><p>He also revealed that PEPFAR would expand its investment to close known gaps in HIV prevention by nearly 20 percent for the fiscal year 2023. </p><p>Participants at the high-level meeting used the hashtag #takethelead to raise awareness through social media. They reiterated the need for the active participation of young women in decision-making around the HIV response and beyond.  They also highlighted the significance of joint efforts with established leaders to promote women’s rights.</p><p>Countries represented by the women leaders included: Botswana, Cameroon, Cote d’Ivoire, Eswatini, Kenya, Lesotho, Malawi, Mozambique, Namibia, Rwanda, South Africa, Tanzania, Uganda, Zambia, and Zimbabwe. Additional partners who supported the meeting in Tanzania included the African Women’s Leaders Network, the United Nations Tanzania, and the Joint United Nations Programme on HIV/AIDS (UNAIDS).</p><p><a href=\"mailto:enyandoro@ke.nationmedia.com\">enyandoro@ke.nationmedia.com</a></p>","link":"https://nation.africa/kenya/news/gender/un-women-pepfar-promote-young-women-s-role-in-global-hiv-response-3987900","slug":"UN-Women-Pepfar-promote-young-women's-role-in-global-HIV-response","date":"2022-10-17T08:30:08Z","articleDate":"17 Oct, 2022","timeAgo":"33 minutes ago","tags":["Gender"," HIV infection","adolescents","gender equality","UN Women"],"photo":"https://nation.africa/resource/blob/3987910/9f9296a5a060e861a341f684d4e4730c/hiv-un-response-photo-data.jpg","caption":"","video":"","author":[{"fullname":"Esther Nyandoro","biography":"","link":"https://nation.africa/kenya/author-profiles/esther-nyandoro-3577898","photo":"https://nation.africa/resource/blob/3454262/b7fc7d20b7fad1119dc5d3c27ad1a2bb/new-logo-data.jpg"}]},{"id":3987914,"title":"Why teen mothers' mental health needs attention","excerpt":"Why teen mothers' mental health needs attention","body":"<p>As the world marked the International Day of the Girl Child under the theme ‘Our time is now – our rights, our future’, one issue stuck out; teenage pregnancy.</p><p>In Kenya, one in every five teenage girls aged 15-19, has either had a live birth, or is pregnant with their first child, according to the National Council for Population and Development.</p><p>But who thinks about their mental well-being?</p><p>Dr Estelle Sidze, a maternal and child health specialist at African Population and Health Research Centre (APHRC) says adolescents are more susceptible to mental ill-being considering the high level of stigmatisation they are subjected to.</p><h2>State of mind</h2><p>“Their stories are terrible when you listen to them,” says the research scientist.</p><p>“Their parents chase them away. When she goes to her boyfriend’s, he also sends her away. The school says, ‘go away because you are showing a bad example to others,’ or nobody wants to hire them because they are pregnant. This leaves them in the darkest state of mind.”</p><p>She also observes a major shift in how the family and community interact with the adolescents which further harms their mental well-being.</p><p>“Nobody asks them how they feel; their experience of being a mother or how they are coping. The questions are (all) about how the child is,” she notes.</p><p>She warns against stigmatisation and isolation of teen mothers. And worst still, ignoring their mental well-being.</p><p>“Studies have shown that depressed women or adolescents don’t seek health services. This is very dangerous; they can experience complications during delivery which could have been prevented during ante-natal visits,” she says.</p><p>“They also don’t take their children for immunisation or breastfed them, yet it is important for the proper development of a child.”</p><h2>Informal settlements</h2><p>From the fourth month of pregnancy to the fourth month after delivery, adolescents are at a higher risk of pre- and post-partum depression, due to hormonal changes and child demands, she says.</p><p>“A baby would be crying when the mother is so tensed up such that she shakes the baby so hard until it dies and they don’t even realise they are killing the child,” she says, while emphasising on taking good care of the teen mothers.</p><p>APHRC has developed a toolkit informed by the experiences of adolescents in informal settlements in Nairobi.</p><p>The toolkit administered by a trained member of the community or household, helps the girls and women cope with pre- and post-partum depression.</p><h2>Stress management</h2><p>It helps in gauging their mental status by asking questions such as “In the last seven days have you felt like you’re always tired? Do you feel like crying? Do you feel like not eating and not doing things that you previously enjoyed doing?”</p><p>It also provides stress management options like speaking with family members and friends. But in the case where their status has deteriorated to a psychosis level, then they are directed to a clinical psychologist.</p><p>Dr Sidze says 25 to 40 per cent of the women in Africa suffer from baby blues and it is important that they are self-aware of their mental health and stress management</p><p>She, however, says pre-and post-depression among women and girls in Africa is under-studied.</p><p>Her appeal is that the mental well-being of teen mothers is taken seriously considering that teenage pregnancy is very high in Kenya</p><p>“Children who suffer from malnutrition and diarrhoea are often those who were not breastfed properly,” says Dr Sidze in relation to the impacts of failing to address the teenagers’ pre- and post-partum depression.</p><p><em>mobiria@ke.nationmedia.com</em></p><p><br/></p>","link":"https://nation.africa/kenya/news/gender/why-teen-mothers-mental-health-needs-attention-3987914","slug":"Why-teen-mothers'-mental-health-needs-attention","date":"2022-10-17T08:41:20Z","articleDate":"17 Oct, 2022","timeAgo":"22 minutes ago","tags":["Africa"," Kenya"," Nairobi"," World"," Africa"," Pregnancy"," Mental Health"," Depression"," Children"," immunisation"," stress"," teenager"," adolescent"," Free"," MORAA OBIRIA"," teen mothers"," teen pregnancies"," International Day of the Girl Child"," National Council for Population and Development"," teenage pregnancy"," Dr Estelle Sidze"," maternal health "," African Population and Health Research Centre"," APHRC"],"photo":"https://nation.africa/resource/blob/3987916/259bbbaf6d00f393edb65efd396a7fd7/teen-mental-health-data.jpg","caption":"","video":"","author":[{"fullname":"Moraa Obiria","biography":"","link":"https://nation.africa/kenya/moraa-obiria-222848","photo":"https://nation.africa/resource/blob/222850/a84077fdebe01c1f61deac643bf02e5a/moraa-pic-data.jpg"}]},{"id":3987738,"title":"Vetting of CS nominees - Live Blog ","excerpt":"Vetting of CS nominees - Live Blog ","body":"<div class=\"html-embed\">\n<section class=\"teasers-row_category nested-cols\">\n<div class=\"col-1-1\">\n<header class=\"teasers-row_header\">\n<h2 class=\"section-label\" style=\"background: #FFB600; color:#000000;\">\nVetting of Ruto's Nominated cabinet - Live Blog\n</h2>\n</header>\n<div id=\"tickaroo-liveblog\" class=\"grid-container\" style=\"height:400px;overflow-y: scroll;background-color: #ffffff;font-size: 1.25rem;line-height: 1.75rem;width:100%\"></div>\n<script>\n(function(e,t,n,r,i,s,o){e[i]=e[i]||function(){(e[i].q=e[i].q||[]).push(arguments)},\ne[i].l=1*new Date;s=t.createElement(n),o=t.getElementsByTagName(n)[0];s.async=1;\ns.src=r;o.parentNode.insertBefore(s,o)})(window,document,'script',\n'//cdn.tickaroo.com/embedjs/tik3.js','_tik');\n_tik('embedLiveblog', {\n\"id\": \"634cec984f5d1011b3bf5ef3\",\n\"clientId\": \"61015cbedc77d3679f2c6865\",\n\"showWebEmbeds\": \"consent_handling\",\n\"showEventMeta\": \"off\",\n\"container\": \"#tickaroo-liveblog\"\n});\n</script>\n</div>\n</section></div>\n\n\n<p><br/></p>","link":"https://nation.africa/kenya/news/politics/vetting-of-cs-nominees-live-blog--3987738","slug":"Vetting-of-CS-nominees-Live-Blog","date":"2022-10-17T08:24:02Z","articleDate":"17 Oct, 2022","timeAgo":"39 minutes ago","tags":[],"photo":"https://i.ytimg.com/vi/zMjst4BG9CA/mqdefault.jpg","caption":"","video":"https://www.youtube.com/embed/zMjst4BG9CA","author":[{"fullname":"David Mwere","biography":"","link":"https://nation.africa/kenya/david-mwere-5448","photo":"https://nation.africa/resource/blob/1164/6e6e85cbe8d319f64edfbfc957b81ecd/logo-data.jpg"}]},{"id":3987734,"title":"Raila leaves Ruto with a message as he flies out to India, other countries","excerpt":"Raila leaves Ruto with message as he flies out","body":"<p>In a statement announcing he will be out the country, Azimio la Umoja One Kenya coalition leader <a href=\"https://nation.africa/kenya/people/raila-amolo-odinga-3809512\" target=\"_blank\" rel=\"noopener\">Raila Odinga</a> on Sunday night called out <a href=\"https://nation.africa/kenya/people/william-samoei-ruto-3809570\" target=\"_blank\" rel=\"noopener\">President William Ruto</a> over his unending expression of disappointments.</p><p>The President and his deputy <a href=\"https://nation.africa/kenya/people/rigathi-gachagua-3815200\" target=\"_blank\" rel=\"noopener\">Rigathi Gachagua</a> have been lashing out at Mr Odinga saying he is to blame over ‘the sorry state of the country.’</p><p>“Can President William Ruto and Kenya Kwanza stop it with the lamentations?” posed Mr Odinga.</p><p>The two Kenya Kwanza government supremos have been accusing Mr Odinga of abandoning his oversight role as leader of opposition during the Jubilee government's reign and allowing the administration loot public.</p><p><strong>Also Read: <a href=\"https://nation.africa/kenya/news/politics/ruto-we-will-fix-uhuru-kenyatta-s-economic-security-mess-3987358\" target=\"_blank\" rel=\"noopener\"><em>We will fix Uhuru Kenyatta's economic, security mess - Ruto</em></a></strong></p><p>Telling his followers he was leaving the country in a tour to several nations across the globe, the Orange Democratic Movement (ODM) party boss said the first country he will be visiting was India.</p><p>“Baba has left the country for a week’s visit to several nations starting with India; see you all when I am back,” Mr Odnga’s statement reads in part.</p><p><strong>Also Read: <a href=\"https://nation.africa/kenya/news/politics/kenya-kwanza-azimio-face-rebellion-over-house-jobs-3986848\" target=\"_blank\" rel=\"noopener\"><em>Kenya Kwanza, Azimio face rebellion over House jobs</em></a></strong></p><h2>Missing Indians</h2><p>Mr Odinga’s visit to India comes after two of their citizens were abducted and went missing in Kenya.</p><p>The two Indian nationals, Mr Zulfiqar Ahmad Khan and Mr Zaid Sami Kidwai, have been missing in Kenya since July.</p><p>Indian authorities through Mr Arindam Bagchi who is the spokesperson in the Ministry of External Affairs in India, said that they were ‘keeping a close watch.’</p><p><strong>Also Read: <a href=\"https://nation.africa/kenya/news/indian-family-seeks-pm-modi-s-intervention-as-media-boss-goes-missing-in-kenya-3985024\" target=\"_blank\" rel=\"noopener\"><em>Indian family seeks PM Modi's help after kin goes missing in Kenya</em></a></strong></p><p>In a statement last week issued by Mr Khan’s friends, the Indian national was visiting the country as a tourist when he suddenly went silent.</p><p>He was scheduled to return to his home country on July 24, 2022, but to date he has never been seen or heard from.</p><p>It is worth noting that Mr Khan was a journalist who in the past worked with several media outlets.</p><p>“As far as we understand, there were two Indian nationals, Zulfiqar Ahmad Khan and Zaid Sami Kidwai. They’ve been missing in Kenya since July 23. A police complaint was filed there soon after that. Subsequently a habeas corpus petition was filed in the Kenyan court. We understand that the issue is in the High Court of Kenya, a number of hearings have taken place. This week, there was a hearing,” Mr Bagchi told the press over the weekend.</p><h2>SSU disbanded</h2><p>However, on Sunday, October 16, President Dr Ruto said that he issued orders demanding that a crack police unit known as Special Service Unit (SSU) be disbanded.</p><p><strong>Also Read: <a href=\"https://nation.africa/kenya/news/why-president-ruto-disbanded-dci-s-special-service-unit-3987662\" target=\"_blank\" rel=\"noopener\"><em>How DCI's Special Service Unit met its demise</em></a></strong></p><p>The Head of State said that he made the decision after an investigation report on the disappearance of two Indian nationals and their taxi driver who was Kenyan was presented to him last week.</p><p>“We have disbanded the unit which was behind a series of extra-judicial killings,” President Dr Ruto said.</p><p>On Sunday, a senior detective at the DCI Headquarters told <em>Nation</em> officers attached to the unit were disarmed and suspended.</p><p>“The officers have also been put under 24-hours surveillance, it remains unclear what the plans are but we shall know with time,” said the senior sleuth who spoke in confidence as they are not authorised to speak to the media.</p><p>During former Directorate of Criminal Investigations (DCI) boss Mr George Kinoti’s reign, SSU was tasked with dealing with serious crimes in the country.</p><p>In December 2019, the DCI overhauled its Anti-Operations Unit in an aim that was meant to fight crime in the country.</p><p>The famous Flying Squad which was accused of extra Judicial Killings was disbanded and replaced by Sting Squad Headquarters (SSH) and the Special Crime Preventions Unit was scaled down and renamed the Special Service Unit (SSU).</p><p>While making the announcement, Mr Kinoti said members of the newly formed units will be directly linked to the Crime Research Intelligence Bureau (CRIB) for intelligence driven operations.</p>","link":"https://nation.africa/kenya/news/politics/raila-leaves-ruto-with-a-message-as-he-flies-out-to-india-other-countries-3987734","slug":"Raila-leaves-Ruto-with-a-message-as-he-flies-out-to-India-other-countries","date":"2022-10-17T07:43:37Z","articleDate":"17 Oct, 2022","timeAgo":"about 1 hour ago","tags":["Kenya"," Raila Odinga"," Raila Odinga"," President Dr William Ruto"," ODM"," Winnie Odinga"],"photo":"https://nation.africa/resource/blob/3970726/e8caf8fd9e355a3056c1d461a5204af9/rao-pix-data.jpg","caption":"","video":"","author":[{"fullname":"Nyaboga Kiage","biography":"","link":"https://nation.africa/kenya/nyaboga-kiage-2582","photo":"https://nation.africa/resource/blob/95774/3e2fe76bf6e83cb9f61e240c3b39fc35/new-logo1-data.jpg"}]},{"id":3987772,"title":"Musalia Mudavadi: I’m worth Sh4 billion","excerpt":"Musalia Mudavadi: I’m worth Sh4 billion","body":"<p>The nominee for Prime Cabinet Secretary Musalia Mudavadi has placed his net worth at Sh4 billion.</p><p>He made the revelation on Monday when he appeared before the Member of Parliament vetting the Kenya Kwanza CS nominees.</p><p>The net worth, he said, was in investment in company shares companies and property.</p><p>Mr Mudavadi was the first Cabinet Secretary nominee to appear before the 15-member National Assembly Committee to be grilled for the position of Prime Cabinet Secretary.</p><p>The Amani leader was nominated by President William Ruto as one of his CSs following the agreement that the ANC and UDA signed before the August election.</p><h2>Sources of income</h2><p>“If I take my investments in shares in some companies and also the properties that I own, I will put my net worth at Sh4 billion,” Mudavadi said.</p><p>He stated that his sources of income are rental, dividends where he has the shares and interests and other expenses that come from his farm.</p><p>He was responding to the question from the National assembly Speaker Moses Wetangula.</p><p>If Mr Mudavadi, who served as Deputy Prime Minister during the Coalition Government of former President Mwai Kibaki and Mr Raila Odinga, sails through, will be the senior most official in government after the President, and Deputy President Rigathi Gachagua.</p><p>Also, the 1990s Goldenberg saga returned to haunt him.</p><p>In his defence, the CS nominee said that he was just new in office as Treasury Minister when the issue was reported.</p>","link":"https://nation.africa/kenya/news/politics/musalia-mudavadi-i-m-worth-sh4-billion-3987772","slug":"Musalia-Mudavadi:-I'm-worth-Sh4-billion","date":"2022-10-17T07:30:04Z","articleDate":"17 Oct, 2022","timeAgo":"about 2 hours ago","tags":["Musalia Mudavadi "," Free"],"photo":"https://nation.africa/resource/blob/3987818/a364b3401eaaafc13b291853d69c4784/madvd-data.jpg","caption":"","video":"","author":[{"fullname":"David Mwere","biography":"","link":"https://nation.africa/kenya/david-mwere-5448","photo":"https://nation.africa/resource/blob/1164/6e6e85cbe8d319f64edfbfc957b81ecd/logo-data.jpg"}]},{"id":3987592,"title":"Expensive crash: How negligence, overloading cost Loreto Convent Sh45 million","excerpt":"How negligence, overloading cost Loreto Convent Sh45 million","body":"<p>July 29, 2011, should have been one of the happiest days in the young lives of 71 pupils at the tail end of their primary school studies at Loreto Convent Msongari.</p><p>Instead, a horrific accident turned it into the darkest day for those who survived and the people in their lives.</p><p>The crash has become one of the most expensive mistakes that still haunt the school to this day, more than a decade later.</p><p>Up until that moment, the Loreto chain of schools was largely known for producing some of the country’s best and brightest with leaders like Nobel Peace Prize winner Wangari Maathai.</p><p>But an act of negligence, overloading a bus with schoolchildren, blighted the institution’s near spotless reputation.</p><p>Last week, High Court judge Joseph Sergon ordered Loreto Convent Msongari to pay over Sh16.5 million to one of the accident victims to cater for past and future medical expenses.</p><p>Justice Sergon’s award means that the school will have paid out Sh45 million to two of its former learners in two years.</p><p>In 2020, the High Court awarded another former pupil that sued the school seeking compensation following the accident.</p><p>Justice Sergon last week awarded Sh14.6 million but ordered that Loreto Convent Msongari also pay interest, at court rates, on the special damages from the date of filing of the suit until full settlement.</p><p>Read: <em><strong><a href=\"https://nation.africa/kenya/news/former-loreto-convent-msongari-pupil-sues-school-over-accident-430080\" target=\"_blank\" rel=\"noopener\">Former Loreto Convent Msongari pupil sues school over accident</a></strong></em></p><p>The court interest rate in Kenya is 14 per cent each year. Justice Sergon awarded Sh1.7 million in special damages and the interest from June 2014 is Sh1.9 million.</p><p>The compensation cases have also given an insight into the agony, suffering and high medical costs incurred by the victims.</p><p>Schools were closed for the second term holidays and, rather than spend that time at home, as usual, the institution had organised a unique trip to Samburu with a stopover in Meru.</p><p>In the travelling group, 35 girls were set to sit for their Kenya Certificate of Primary Education (KCPE) exams that year. The other 36 were in their penultimate year of primary education.</p><p>Aside from the joy of roving about the beautiful countryside, the pupils were to get a first-hand view of how coffee farms and factories contribute to Kenya’s economy.</p><p>The icing on the cake was the fact that, for the next few days, the pupils would rest their heads at Sarova Shaba, one of the country’s hospitality centrepieces located at Archer’s Post in Samburu County. The full package.</p><p>For almost all of that second term, the school had talked up the trip intended for classes seven and eight pupils to the point that everyone was looking forward to the excursion.</p><p>Early that morning, parents dropped their children at school. The pupils knew they were to travel in two buses. But moments before departure, the headteacher, Ms Margaret Sewe, who was also part of the travelling party, ordered all pupils and the nine teachers into one bus.</p><p>Some of the girls had to carry their classmates. After visiting a coffee farm in Meru, the team departed for Samburu.</p><p>But, while going downhill at Subugia along the Meru-Nanyuki highway, the brakes failed and the driver, Patrick Oduor, lost control of the vehicle. After rolling several times, the vehicle hit another a Kerugoya Boys High School bus.</p><h2>Fatal crash</h2><p>Two girls died on the spot and a third lost her life while receiving treatment at a nearby hospital. At least 30 others needed urgent medical attention.</p><p>Of those, 18 had to be rushed to Nairobi Hospital by ambulance and three, were airlifted to the same facility in critical condition.</p><p>The Kerugoya Boys bus was ferrying the school’s staff from Isiolo. In what was perhaps pure luck or divine intervention, the Kerugoya Boys' teachers had stepped out of their bus to get refreshments. Three members of their team, however, sustained minor injuries and were treated before being discharged.</p><p>It was not so lucky for some of the survivors in the Loreto Convent Msongari side. Six of the young ones had to be amputated to avoid fatal infections.</p><p>On June 9, 2014, one of the survivors sued the school for negligence. She was treated at the Aga Khan University Hospital in Nairobi and Apollo Hospital in India.</p><p>That was, however, far from the end of that journey as she still has a number of reconstructive procedures to make her life a bit more comfortable.</p><p>Seven years later, the victim and Loreto Convent Msongari reached an out-of-court settlement. The school accepted liability and agreed to pay Sh3 million in general damages.</p><h2>General damages</h2><p>The only issue for Justice Sergon to determine was how much to award in special damages and other compensation claims by the victim.</p><p>In law, general damages are awarded to cater for direct physical or psychological injuries arising from an incident.</p><p>Special damages are given to compensate costs that a victim has incurred and are intended to return the individual to the same financial position they were in at the time of the incident.</p><p>Justice Sergon dismissed claims from the plaintiff for costs for food, shopping and other requirements, instead opting to restrict himself to past and future medical expenses.</p><p>The plaintiff will have to undergo eye surgery (Sh1.7 million), reconstruction of her right eyelid (Sh1.8 million), surgeries on her arms and chest (Sh9.2 million) and two therapy sessions each month for one year (Sh193,200).</p><p>She had sought Sh15 million to cater for her future medical costs, travel expenses to and from the Czech Republic and accommodation for her guardian while abroad for treatment.</p><p>Two years ago, Justice Lucy Njuguna awarded another victim Sh14.7 million for medical expenses, interest on special damages at Sh10.7 million and legal costs of Sh1.1 million.</p><p>The victim was initially hospitalised for 22 days. She later had surgeries done in Nairobi and London. She is now a 22-year-old advocate practising in one of Kenya’s most prestigious law firms.</p><p><em><strong>bwasuna@ke.nationmedia.com</strong></em></p>","link":"https://nation.africa/kenya/news/expensive-crash-how-negligence-overloading-cost-loreto-convent-sh45-million-3987592","slug":"Expensive-crash:-How-negligence-overloading-cost-Loreto-Convent-Sh45-million","date":"2022-10-17T06:14:25Z","articleDate":"17 Oct, 2022","timeAgo":"about 3 hours ago","tags":["Kenya"," News"," Loreto Convent Msongari accident","Joseph Sergon","Margaret Sewe","Justice Lucy Njuguna","Patrick Oduor"],"photo":"https://nation.africa/resource/blob/3987594/8c9d827bd642b3279a18633ac98ca61c/mvatie-pix-data.jpg","caption":"","video":"","author":[{"fullname":"Brian Wasuna","biography":"","link":"https://nation.africa/kenya/brian-wasuna-79880","photo":"https://nation.africa/resource/blob/1913292/731bcf60e836d4c7c93dcee09e56846c/brian-wasuna-photo-data.jpg"}]},{"id":3987004,"title":"Evans Kidero: Ruto is passionate about Kenya and has the energy","excerpt":"Evans Kidero: Why I now back Ruto","body":"<p>As supporters of Azimio la Umoja leader <a href=\"https://nation.africa/kenya/people/raila-amolo-odinga-3809512\">Raila Odinga</a> regroup after his recent failed presidential bid, there is a growing list of influential individuals, especially in his Nyanza base, urging the veteran opposition politician to exit the stage to allow younger successors to take over.</p><p>The push for Mr Odinga’s retirement from active politics is louder from leaders who lost in ODM primaries. Some opted to run as independent candidates.</p><p>There is a feeling that the bungled nominations in Azimio strongholds could have been to blame for the low voter turnout and the former Premier’s loss.</p><p>Former Nairobi Governor <a href=\"https://nation.africa/kenya/counties/homa-bay/petitions-to-annul-governors-wanga-nyaribo-wins-filed-3941724\">Evans Kidero, who has filed a petition challenging the way he lost the Homa Bay governor’s seat</a> in the General Election, is seen by some as an alternative to Mr Odinga.</p><p>In a wide-ranging interview with Sunday Nation’s <strong><em>Moses Nyamori</em></strong>, he describes ODM as a discriminatory outfit, calls for radical change in leadership in the Nyanza region and declares his willingness to work with President William Ruto.</p>\n\n <figure class=\"article-picture\">\n <div class=\"lazy-img-container img-space_landscape_ratio2x1\">\n\n\n <img data-src=\"/resource/image/3987008/landscape_ratio2x1/320/160/ad2420bd945e45efd1ecf40d67396e6c/sZ/evans-kidero.jpg\"\n data-srcset=\"\n /resource/image/3987008/landscape_ratio2x1/320/160/ad2420bd945e45efd1ecf40d67396e6c/sZ/evans-kidero.jpg 320w,\n /resource/image/3987008/landscape_ratio2x1/640/320/ad2420bd945e45efd1ecf40d67396e6c/jg/evans-kidero.jpg 640w,\n /resource/image/3987008/landscape_ratio2x1/720/360/ad2420bd945e45efd1ecf40d67396e6c/VL/evans-kidero.jpg 720w,\n /resource/image/3987008/landscape_ratio2x1/960/480/ad2420bd945e45efd1ecf40d67396e6c/yA/evans-kidero.jpg 960w,\n /resource/image/3987008/landscape_ratio2x1/1280/640/ad2420bd945e45efd1ecf40d67396e6c/eK/evans-kidero.jpg 1280w\n \"\n sizes=\"(min-width: 820px) 820px, (min-width: 630px) 630px, 100vw\"\n\n alt=\"Evans Kidero\"\n width=\"100\"\n height=\"100\"\n class=\"lazy-img\"\n data-lazy-img=\"true\"\n loading=\"lazy\" />\n\n\n </div>\n\n <figcaption class=\"article-picture_caption\">\n<p>Former Nairobi governor Dr. Evans Kidero during the interview in Nairobi on October 5, 2022.</p>\n <div class=\"article-picture_copyright\"><span class=\"article-picture_credit\">Photo credit:</span> Jeff Angote | Nation Media Group</div>\n </figcaption>\n </figure>\n<p>Below are the excerpts.</p><p>*****</p><p><strong><em>What informed your decision to switch from Nairobi to Homa Bay County?</em></strong></p><p>I decided to go to Homa Bay because I had interests in ensuring it develops. For the last 10 years, Homa Bay had not seen development.</p><p>We had an eight-point agenda: health and water; education; infrastructure; investments and industry; trading; and putting money into people’s pockets.</p><p>We had a proper agenda which we were going to ensure we put in place. When the elections came, people know what happened.</p><p>We have a petition in court, which I don’t want to talk about here. We have every belief that the election will be overturned.</p><p>The President came to Homa Bay in his first visit to Luo Nyanza. Has he reached out to you to work with him?</p><p>He is our President. He got Kenya’s mandate. This was challenged and it was confirmed by the Supreme Court.</p><p>I support the President and I will work with him in whatever form, in whatever way and in whatever capacity to help bring development that we need to bring to this country.</p><p><strong><em>How would you describe your relationship with President Ruto? How often do you engage?</em></strong></p><p>I have known the President for a long time. You remember when I was in the sugar industry, the President was the Agriculture minister and that is the time when we had the highest sugar production in this country.</p><p>The total sugar requirement then was 800,000 metric tonnes, and that is when we broke the record for two straight years.</p><p>We were producing up to 600,000 metric tonnes. Now the requirement is slightly above 1,000,000 metric tonnes but production has dropped to about 400,000.</p><p>It was because of the good cooperation and him being sensitive to the requirements of the industry. Between the years when he was in the ministry, we made such great achievements.</p><p><strong><em>Would you consider taking any appointments by the President?</em></strong></p><p>So long as it is going to add value and bring a difference to the people of Kenya, I will work with the government of the day.</p><p>There has been talk about <a href=\"https://nation.africa/kenya/news/politics/president-william-ruto-raids-raila-s-homa-bay-backyard-with-bagful-of-goodies-3970322\">elected leaders from Homa Bay failing to welcome the President</a> when he visited recently, including Governor Gladys Wanga. What is your view on that?</p><p>I am not aware where the governor was but I think it was rather sad that the governor was not there. President Ruto is our leader and every other leader has to work with him to deliver on his mandate.</p><p>We have national and county governments that have to work in consultation.</p><p><strong><em>What should Nyanza and its leadership do to ensure the region benefits from projects by the national government?</em></strong></p><p>What I would urge leaders, particularly leaders from Luo Nyanza is: let’s join hands and work with the President.</p><p>I mean, it is not a strange thing. After the 2017 elections didn’t Jakom (<a href=\"https://nation.africa/kenya/people/raila-amolo-odinga-3809512\">Raila Odinga</a>) shake hands with (President) <a href=\"https://nation.africa/kenya/people/uhuru-muigai-kenyatta-3809330\">Uhuru Kenyatta</a> and work with him until his term ended?</p><p>Now Ruto is our President and he is very passionate about this country and he’s got the energy.  And his vision is very clear.</p><p>He wants to improve the standards of living for our people. Let’s all work with him so that we can have development.</p><p>We were supporting Raila Odinga. Unfortunately, he did not win. William Ruto and Rigathi Gachagua are now the President and Deputy President.</p><p><strong><em>Nyanza has been out of government for successive regimes, including the current administration. Why is this so?</em></strong></p><p>Let’s go back to history: if it wasn’t for people from Luo Nyanza, probably (Jomo) Kenyatta would not have been President.</p><p>From 1969, we have operated more or less outside the government. I think this is the time because Ruto has extended a hand of welcome despite having run against Raila and everybody (from the region) voted Raila to the last man and woman in the region.</p><p>He has come to Nyanza and has extended an olive branch. Let’s grab it and let’s work with him so that we can develop. He talked about roads in the area and said they will be done. We have been talking about having fish as our primary source of income, yet our people don’t benefit.</p><p><strong><em>Is the region’s long stay in the opposition due to the kind of leadership it has?</em></strong></p><p>No, I don’t think so. That is history that we are not going to go back to. Eighty percent of the current voters were born after 1990.</p><p>There could be historical factors but they don’t have a relationship with some of those historical factors.</p><p>What I must say is that Jakom has played a major role. Our democratisation process would not have been what it is if it was not for him and he has earned himself a place in history. He must be respected and will always be respected. But we must move forward with the rest of the Kenyans.</p><p><strong><em>What do you mean by moving forward? Is it having a new leadership for the region?</em></strong></p><p>Absolutely. New thinking and new investments. In education, Tom Mboya (University) got a charter just a few weeks before the President retired. Tom Mboya has only 2,000 students. We want to see it expanding because that is going to be the centre of the blue economy. We want to see it having 15,000 students with campuses in Sindo, Mbita, Oyugis, Asumbi, Rangwe.</p><p>Where there are students it will spur development in real estate and in the food industry and education. We want to see our children in primary school learn in good setups so that they can compete.</p><p><strong><em>Would you say it is time for Raila to exit the political scene?</em></strong></p><p>I think Jakom has played his role and will continue playing his role because he is an elder statesman. President Ruto said he will be engaging him and President Kenyatta in a special way so that they can continue playing their role as elder statesmen. But we must move forward so that we join the rest of the country in developing our country.</p><p><strong><em>What kind of leadership does Nyanza need? Are you ready to take the mantle?</em></strong></p><p>We are looking for non-discriminative leadership. We are looking for democratic leadership and we are looking for forward-looking leadership.</p><p>We do not want to be in a situation where we keep on complaining. Let bygones be bygones. Let’s move forward.</p><p><strong><em>You were denied an ODM ticket in the run-up to the August 9 polls. Why do you think you were not the party’s favourite?</em></strong></p><p> There were never primaries in ODM. People were appointed and given direct tickets. Neither were we called. You saw what President Ruto did. UDA had nominations and for those who did not succeed, he called all of them together and had a discussion with them. We expected, as ODM people, that that is what we should have done. We expected to have a discussion but that never happened.</p><p>People were appointed, people protested, wananchi protested but as part of moving on we moved on from there. I am no longer in ODM. I ran as an independent candidate and going forward I will be looking for a new home where I and the rest of the people not accommodated in ODM can be.</p><p><strong><em>Is Democratic Congress the new home you are talking about?</em></strong></p><p>We will let our people know in due course because where you are is where the people want to be. We will ask our people where they want us to be.</p><p><strong><em>Do you have certain leaders in mind you are planning to work with in the new party?</em></strong></p><p>We are consulting widely.  We are talking widely but what is important is that we have to move forward. People in Nyanza have to join the rest of the other counties.</p><p>Some would argue that you shouldn’t be crying foul for being denied an ODM ticket because in 2017 you were also a beneficiary of a direct ticket.</p><p>I was not given a direct ticket because there was nobody who stood. Was there anybody who stood against me in 2017? None. In 2013 also, I was not given a direct ticket; Margaret Wanjiru stood but did not have the academic qualifications. She was disqualified because she did not have papers.</p><p><strong><em>What do you think made Raila lose? What went wrong with your campaigns and who is to blame?</em></strong></p><p>I supported him, I campaigned for him, and I know the people talked about six-piece. They said they did not need non-party people to support Raila. I remember in my billboard, I had a Raila image and I have letters from lawyers threatening to take me to court because being an independent I should not associate with Raila. I think that was a mistake. To a large extent, our problem – or the problem of ODM – was about nomination. Some 700,000 people did not vote in Luo Nyanza because they felt disenfranchised. If those 700,000 people voted, we would be talking about a different story.</p><p><strong><em>How has life been after exiting the Nairobi governor’s seat?</em></strong></p><p>I have had a fairly successful career. Right now, I am a normal Kenyan citizen leading a normal life but very concerned about the country.</p><p>I first ran in 2013, was governor for five years and during my tenure in Nairobi realised some of the biggest projects like housing and infrastructure.</p><p>In 2017, a new governor came in and when I handed over power, I said Nairobi is not a walk in the park.</p><p>For sure, it happened that it was not a walk in the park and Nairobi had to be divided to be run partly by the Nairobi Metropolitan Services (NMS).</p><p>Finally, the governor (Mike Sonko) got impeached.</p><p>Now we have Governor Johnson Sakaja, and wish him well and I have confidence that Nairobi is in good hands.</p><p>Read also: <strong><em><a href=\"https://nation.africa/kenya/counties/homa-bay/how-azimio-brought-multipartism-to-homa-bay-3810656\">How Azimio brought multipartism to Homa Bay</a></em></strong></p><p><strong><em>2. <a href=\"https://nation.africa/kenya/counties/homa-bay/kidero-slams-odm-leaders-invites-disgruntled-members-to-join-him-3959572\">Kidero slams ODM leaders, invites disgruntled members to join him</a></em></strong></p><p><strong><em>3. <a href=\"https://nation.africa/kenya/counties/homa-bay/kidero-seeks-homa-bay-election-material-from-iebc-to-challenge-wanga-win-3927010\">Kidero seeks Homa Bay election material from IEBC, to challenge Wanga win</a></em></strong></p><p><strong><em>mnyamori@standardmedia.com</em></strong></p>","link":"https://nation.africa/kenya/news/politics/evans-kidero-ruto-is-passionate-about-kenya-and-has-the-energy-3987004","slug":"Evans-Kidero:-Ruto-is-passionate-about-Kenya-and-has-the-energy","date":"2022-10-17T05:40:13Z","articleDate":"17 Oct, 2022","timeAgo":"about 3 hours ago","tags":["Governance"," William Ruto "," Evans Kidero","Raila Odinga","ODM","democracy"," IEBC "],"photo":"https://nation.africa/resource/blob/3987292/b698f2d0dd37331c20a89bf67f49e8e3/kidero-ruto-data.jpg","caption":"","video":"","author":[{"fullname":"Moses Nyamori","biography":"","link":"https://nation.africa/kenya/news/moses-nyamori-3800384","photo":"https://nation.africa/resource/blob/3454262/b7fc7d20b7fad1119dc5d3c27ad1a2bb/new-logo-data.jpg"}]},{"id":3986882,"title":"High TV drama expected as Ruto's CS nominees are vetted from today","excerpt":"Moment of reckoning for Ruto's CS nominees","body":"<p>Integrity, past records in public service and suitability questions are likely to dominate the <a href=\"https://nation.africa/kenya/news/mps-to-start-vetting-cs-nominees-on-monday-3982688\">vetting of President William Ruto’s Cabinet secretary nominees</a> that kicks off today with Azimio la Umoja One Kenya Coalition party targeting at least seven of the appointees.</p><p class=\"Ar Au Ao\">The <a href=\"https://nation.africa/kenya/people/raila-amolo-odinga-3809512\">Raila Odinga</a>-led coalition says despite the <a href=\"https://nation.africa/kenya/news/withdrawal-of-graft-cases-exposes-state--3985868\">withdrawal of some cases</a> of nominees by the Director of Public Prosecutions (DPP) Noordin Haji, it does not amount to absolving someone from having the moral authority to occupy a public office.</p><p class=\"Ar Au Ao\">On the radar of Azimio are Public Service nominee <a href=\"https://nation.africa/kenya/news/dpp-withdraws-sh19m-graft-case-against-aisha-jumwa-3982262\">Aisha Jumwa</a>, her agriculture counterpart Mithika Linturi, Trade nominee Moses Kuria, David Chirchir (Energy), Alfred Mutua (Foreign Affairs), Prof Njuguna Ndung’u (Treasury) and Susan Wafula (Health).</p><p class=\"Ar Au Ao\"><a href=\"https://nation.africa/kenya/people/musalia-mudavadi--3813542\">Prime Cabinet Secretary Musalia Mudavadi</a> is also on the spot over the legality of his position, a decision National Assembly Speaker Moses Wetang’ula is expected to make tomorrow after it was brought up by the Azimio House leadership.</p><p class=\"Ar Au Ao\">The coalition says Prof Ndung’u and Dr Mutua have questions to answer touching on their previous offices as Central Bank of Kenya (CBK) Governor and Machakos County boss, respectively.</p><p class=\"Ar Au Ao\">Read: <strong><em><a href=\"https://nation.africa/kenya/news/lsk-censures-dpp-noordin-haji-after-cases-dropped-3983758\">LSK censures DPP Noordin Haji after cases dropped</a></em></strong></p><p class=\"Ar Au Ao\">Prof Njuguna’s corruption charges involving Sh1.2 billion controversial security tender awarded to Horsebridge Network Systems was in 2018 dismissed by the Court of Appeal after fighting the allegations for three years.</p><p class=\"Ar Au Ao\">In 2012, National Assembly Public Accounts Committee (PAC) in a report to the House had recommended that Prof Ndung’u, together with then Transport minister Amos Kimunya, be investigated over a <a href=\"https://nation.africa/kenya/news/politics/kimunya-ndung-u-survive-house-censure-over-de-la-rue-saga-827006\">controversial currency printing contract with UK firm De La Rue</a>.</p><p class=\"Ar Au Ao\">The report also proposed that the two be barred from holding public office. The report was, however, rejected by the House to the relief of the two, who were cleared. There were also allegations touching on the then CBK governor and his links with an official of the collapsed Imperial Bank.</p><p class=\"Ar Au Ao\">Read: <strong><em><a href=\"https://nation.africa/kenya/news/politics/political-bigwigs-whose-ps-ambitions-were-cut-short-by-psc-3983880\">Political bigwigs whose PS ambitions were cut short by PSC</a></em></strong></p><p class=\"Ar Au Ao\">Dr Mutua was also cleared by the court over an alleged fraudulent acquisition of 16 motor vehicles for the county government.The opposition coalition also plans to turn its spotlight on Ms Wafula’s with questions about gaps in her academic qualifications that she will have to explain when she appears before the committee chaired by Mr Wetang’ula.</p><p class=\"Ar Au Ao\">The DPP on Wednesday withdrew the Sh19 million graft charges against Ms Jumwa. The complainant in <a href=\"https://nation.africa/kenya/news/i-m-the-victim-linturi-tells-court-in-rape-case-3832430\">Mr Linturi’s rape case</a> also dropped the case against the former Meru senator to explore an out of court settlement. The withdrawal of the cases, among others, has raised eyebrows, prompting the Law Society of Kenya (LSK) to give DPP Noordin Haji a three-day ultimatum (that ends today) to explain his actionsPokot South MP David Pkosing, who sits in the committee on appointments that will vet the Cabinet secretary nominees, questioned the timing by the DPP to drop the cases.</p><p class=\"Ar Au Ao\">He said the allegations in the cases will still be brought up during vetting. “The big question is why now? Why couldn’t he do it last year or before they were nominated? This tells us one thing that his office is not independent as it ought to be,” Mr Pkosing said.Sources in Azimio also disclosed that Mr Kuria has previously faced <a href=\"https://nation.africa/kenya/news/politics/moses-kuria-acquitted-of-incitement-charges--384978\">hate speech charges</a> in court while Mr Chirchir has no track record of performance in the Ministry of Energy.</p><p class=\"Ar Au Ao\">Mr Kuria has never been found guilty for any of the charges.Mr Chirchir left the ministry in March 2015, after he featured in a so-called “list of shame” prepared by the Ethics and Anti-Corruption Commission and presented to Parliament by <a href=\"https://nation.africa/kenya/people/uhuru-muigai-kenyatta-3809330\">President Uhuru Kenyatta</a>.</p><p class=\"Ar Au Ao\">He was shown the door alongside Mrs Charity Ngilu (Lands), Engineer Michael Kamau (Transport), Felix Koskei (Agriculture), and Kazungu Kambi (Labour), over various integrity issues.</p><p class=\"Ar Au Ao\">Mr Chirchir’s issues with EACC went back to his time at the defunct Interim Independent Electoral Commission (IIEC) — the precursor of the Independent Electoral and Boundaries Commission — before he was appointed to the Cabinet. He was among those named in a <a href=\"https://nation.africa/kenya/news/britons-in-iebc-bribe-case-sent-to-jail-by-uk-court-1067944\">kickbacks scandal involving the award of a lucrative ballot paper printing contracts to British company Smith and Ouzman</a>.</p><p class=\"Ar Au Ao\">Mr Chirchir was, however, cleared by the Ethics and Anti-Corruption Commission and no charges were preferred against him.Azimio Nominated MP John Mbadi told the <em>Sunday Nation</em> that apart from integrity, they will also be looking at suitability, previous track record and right placement of nominees to the various ministries in relation to their academic qualifications.</p><p class=\"Ar Au Ao\">“People like Chirchir were in the Energy ministry before, we want to know what they did while there. What did they achieve that they can remember that makes them to be given the docket again? These are questions that we must ask,” Mr Mbadi said.</p><p class=\"Ar Au Ao\">He added: “Is Aisha Jumwa the most qualified person to handle the policies of our public service? We need someone who can bring policy directions to Parliament and I don’t think she is the person that can do that.” Azimio has already raised issues with the nomination of Mr Mudavadi, the Amani National Congress leader, questioning the legality of the position and how the committee is going to vet him.</p><p class=\"Ar Au Ao\">Mr Wandayi on Thursday at the first meeting of the committee on appointments to set ground rules for the exercise said Mr Mudavadi holds no docket hence it will be difficult for the committee to ask specific questions in regards to his role in the Ruto administration. There are also questions about the creation of the position.</p><p class=\"Ar Au Ao\">“The fact that this Prime Cabinet Secretary holds no docket puts the vetting committee in a difficult position. How are we going to interrogate the nominee?” Mr Wandayi said.Speaker Wetang’ula is expected to rule on the matter tomorrow morning before the exercise begins.A schedule released by Parliament indicates that Mr Mudavadi will be the first nominee to face MPs.</p><p class=\"Ar Au Ao\">Kenya Kwanza had indicated plans to introduce legislation in Parliament to regularise the new position .The ruling alliance has, however, remained mum over the decision with no indications that it was likely to introduce any legislation to give the new office legal backing.</p><p class=\"Ar Au Ao\">Read: <strong><em><a href=\"https://nation.africa/kenya/news/politics/gachagua-and-mudavadi-clash-of-roles--3967164\">Gachagua and Mudavadi: Clash of roles?</a></em></strong></p><p class=\"Ar Au Ao\">Article 152 of the constitution defines the Cabinet as consisting of the President, the Deputy President, the Attorney-General; and not fewer than 14 and not more than 22 Cabinet Secretaries. Article 21 (k) of the Kenya Kwanza coalition agreement on the sharing of national government responsibilities provides how Mr Mudavadi’s responsibilities will be created in the new government.</p><p class=\"Ar Au Ao\">“Within 30 days following the General Election, the coalition shall introduce in Parliament legislation that shall provide greater legal clarity on the position, roles and functions of Prime Cabinet Secretary,” the coalition agreement reads, in part. It adds: “The legislation to be introduced shall amend the National Government Coordination (NGC) Act to include the Office of the Prime Cabinet Secretary and incorporate and align the functions of the Prime Cabinet Secretary as proposed herein to the existing structures under the aforesaid Act.”</p><p class=\"Ar Au Ao\">Former National Assembly Justin Muturi will be the second on the list, followed by former Majority Leader and Garissa Township MP Aden Duale with Dr Mutua and Kandara MP Alice Wahome summing up the first day of the exercise. Prof Ndung’u, Mr Chirchir , Prof Kithure Kindiki (Interior and National Security), Ms Jumwa and former Gatundu MP Moses Kuria are all lined up to face the committee on Tuesday. Mr Pkosing said nominees should be prepared for tough questions, ranking integrity as the key consideration.</p><p class=\"Ar Au Ao\">“There are people there who in terms of education, they are okay but when it comes to integrity, there is a big question. I have a lot of critical questions which I will ask but I can assure you that we are not going to be rubber stamp,” Mr Pkosing told the <em>Sunday Nation</em>. He disclosed that should Kenya Kwanza force some nominees on them, then Azimio will write a minority report registering their dissent.</p><p class=\"Ar Au Ao\">“We are not children, we will write a minority report should they push those nominees with integrity questions,” Mr Pkosing said. A minority report or reservation is part of the main report by the majority side and if the minority argue their case on the floor of the House properly and convince the majority of members, then the House can amend and adopt the report in its entirety to reflect the views of those who were minority in the committee.</p><p class=\"Ar Au Ao\">Previous Speakers have ruled that there can only be one report to be tabled before the House hence a minority report, also called reservation, can only be part of the main report but will form part of debate in the plenary while adopting or rejecting a report.</p><p class=\"Ar Au Ao\">Mr Wandayi said Parliament will not be a rubber stamp and matters of ethics and integrity to serve in public office will be given consideration by the Azimio team during the vetting.“We must not as a House lose sight of the requirements of the constitution, Public Office Act, Ethics and Economic Crimes Act. We will take our time to interrogate each and every nominee,” Mr Wandayi said.</p><p class=\"Ar Au Ao\">Read: <strong><em><a href=\"https://nation.africa/kenya/news/justin-muturi-from-speaker-to-kenya-s-next-attorney-general-3964324\">Justin Muturi: From Speaker to Kenya’s next Attorney-General</a></em></strong></p><p class=\"Ar Au Ao\">\"Even as the committee sits to look at the suitability of the nominees, as a House, will look at the whole package first. For instance we know about principles of good governance, gender balance and regional balance. The first question we will ask, does the list meet all that?” asked Mr Wandayi.</p><p class=\"Ar Au Ao\">Budalang’i MP Raphael Wanjala said while integrity will be the main issue, Azimio will also be seeking to know why cases of some nominees were withdrawn after they were named by President Ruto.“Why have the cases been withdrawn? This is a clear indication that they are hiding something. A crime has been committed and is being concealed. Such people should not even be brought before the committee on appointments for vetting,” Mr Wanjala said.</p><p class=\"Ar Au Ao\">Saboti MP Caleb Amisi (ODM), also a member of the committee, said the opposition coalition will expose the rot among the nominees. Mr Amisi said Azimio is ready to write a minority report to make public integrity issues touching on some of the nominees.</p><p class=\"Ar Au Ao\">“If the rest will decide to be conveyor belts, we as Azimio will ensure that only those who meet the integrity test get our approval. The majority will definitely have their way but we will also have our say,” said Mr Amisi.“</p><p class=\"Ar Au Ao\">We will expose the rot of some of the nominees by doing minority report if need be so that the public can get to know the kind of people who will be sitting in the Cabinet,” he added. Kitui Central MP Makali Mulu disclosed that the coalition’s lawmakers were under instructions not to be conveyor belts in the vetting.</p><p class=\"Ar Au Ao\">“As a coalition, we have come out clearly that we have our reservations on some of the individuals nominated to the Cabinet. Our members sitting in the Committee on Appointments have been instructed to point out shortcomings of the nominees,” said Mr Mulu.He added: “At the plenary we will also point out the shortcomings of the nominees; those who have court or corruption-related cases. We know there is always whipping of members to take certain decision, but I can tell you that if the MPs can be allowed to make independent decisions then some of the names will definitely be dropped,” he added.</p><p class=\"Ar Au Ao\">Majority leader Kimani Ichungwa said the vetting will be conducted in a transparent manner and they will be fair to all the nominees together with other members of the public who will have any memorandum against any nominee.</p><p class=\"Ar Au Ao\">“If there are any Kenyans out there that have any memoranda against the nominees should submit to the committee, we promise to consider all the memoranda. We will give opportunities to those mentioned to respond. We will be fair to everybody,” Mr Ichungwa said.</p><p class=\"Ar Au Ao\">Mr Ichungwa, however, warned the Cabinet secretary nominees that none of them have their jobs until they are approved by the House adding that the vetting process will be transparent.</p><p class=\"Ar Au Ao\">“All the members of this House are eager to put them into account both in public and private, so they should be alerted in advance,” Mr Ichungwa said. Wiper leader Kalonzo Musyoka on Tuesday said Azimio coalition has issued strict instructions to their members that will participate in the vetting of Cabinet nominees not to participate in a process where individuals with integrity questions are given a lifeline by parliament.</p><p class=\"Ar Au Ao\">“I want to tell those that will be in the Committee of Appointments that those people with integrity issues will come to you with fat envelopes but reject the envelope and also reject the nominees,” Mr Musyoka said.</p><p class=\"Ar Au Ao\">Mr Musyoka called on the EACC and the Directorate of Criminal Investigations to do their work independently and submit to parliament their reports on some of the nominees. Section 6 (9) of the public appointments (parliamentary approval) Act of 2011 also provides that “any person may, prior to the approval hearing and by written statement on oath, provide the clerk with evidence contesting the suitability of a candidate to hold the office to which the candidate has been nominated.</p><p class=\"Ar Au Ao\">Article 232 of the constitution provides for the values and principles of public service which include high standards of professional ethics, efficient, effective and economic use of involvement of the people in the process of policy making, accountability for administrative acts, transparency and provision to the public of timely, accurate information for those serving in public offices. Article 130 (2) of the constitution provides that the composition of the National government shall reflect regional and ethnic diversity of the people of Kenya.</p><p class=\"Ar Au Ao\"><em>Additional reporting by Moses Nyamori, smundu@ke.nationmedia.com</em></p>","link":"https://nation.africa/kenya/news/politics/high-tv-drama-expected-as-ruto-s-cs-nominees-are-vetted-from-today-3986882","slug":"High-TV-drama-expected-as-Ruto's-CS-nominees-are-vetted-from-today","date":"2022-10-17T05:31:29Z","articleDate":"17 Oct, 2022","timeAgo":"about 4 hours ago","tags":["Kenya"," Governance"," Free"," William Ruto","Raila Odinga"],"photo":"https://nation.africa/resource/blob/3987226/37ca0c4686b34cf23689b5a84bf5d15f/ruto-cabinet-1--data.jpg","caption":"","video":"","author":[{"fullname":"Samwel Owino","biography":"","link":"https://nation.africa/kenya/samwel-owino-2952","photo":"https://nation.africa/resource/blob/1928572/af62e22eecbc6d197f146f6ef83692bc/whatsapp-image-2020-08-30-at-11-24-51-3--data.jpg"}]},{"id":3987614,"title":"State House: Moi staff, cars recalled before Ruto’s time","excerpt":"State House: Moi staff, cars recalled before Ruto’s time","body":"<p>State House has denied claims that the government ordered the seizure of vehicles and redeployment of staff at former President Daniel arap Moi’s Kabarak home, two years after the country’s second died in February 2020. </p><p>Outgoing State House Comptroller Kinuthia Mbugua said the vehicles, staff and security personnel attached to the former President’s office were withdrawn shortly after he died, and not during <a href=\"https://nation.africa/kenya/people/william-ruto-3809570http://\" target=\"_blank\" rel=\"noopener\">President William Ruto</a>’s tenure, which began on September 13 when he took the oath of office.</p><p>“The benefits of a retired President are clearly spelt out in the Presidential Benefits Act, 2003 with Section 5 specifically stating that pensions and other benefits of a retired president (which include cars and staff) are to be enjoyed during his lifetime,” Mr Mbugua said in a statement,</p><p>Read: <em><strong><a href=\"https://nation.africa/kenya/news/politics/kibaki-and-moi-retirement-perks-abolished-by-judge-1127198http://\" target=\"_blank\" rel=\"noopener\">Kibaki and Moi retirement perks abolished by judge</a></strong></em></p><p>He continued: “They cease from the day of his demise. Hence pension and other benefits entitled to former President Daniel Moi ceased on February 4, 2020.”</p><p>Mr Mbugua said the recalling of cars and staff was lawful and took place before President Ruto assumed office.</p><p>However, the <em>Nation</em> learnt that some of the cars were recalled only two months ago, shortly before the new administration took office.</p><p>One of the senior officers is said to have retained about five cars which were supposed to be used by President Moi for his domestic work and comfort when he was alive.</p><p>Read: <em><strong><a href=\"https://nation.africa/kenya/news/how-daniel-moi-favoured-sons-over-daughters-in-his-will-3661224\" target=\"_blank\" rel=\"noopener\">How Moi favoured sons over daughters in his Will</a></strong></em></p><p>The cars were taken away about two months ago. Other officers seconded to Mzee Moi’s home at Kabarak said they surrendered their cars last year.</p><p>“I surrendered my official Subaru Forester last year after I retired,” said Mr Lee Njiru, a long-serving director of the Presidential Press Unit during the Jomo Kenyatta and Moi administrations. </p><p><em><strong>fmureithi@ke.nationmedia.com</strong></em></p>","link":"https://nation.africa/kenya/news/state-house-moi-staff-cars-recalled-before-ruto-s-time-3987614","slug":"State-House:-Moi-staff-cars-recalled-before-Ruto's-time","date":"2022-10-17T03:18:33Z","articleDate":"17 Oct, 2022","timeAgo":"about 6 hours ago","tags":["Kenya"," News"," Daniel Moi","State House Comptroller Kinuthia Mbugua ","State House","President William Ruto","Presidential Benefits Act","Kabarak"],"photo":"https://nation.africa/resource/blob/3987618/7dc2be2c025ec8fa1a85348350d901e9/moi-pix-1-data.jpg","caption":"","video":"","author":[{"fullname":"Francis Mureithi","biography":"","link":"https://nation.africa/kenya/francis-mureithi-6886","photo":"https://nation.africa/resource/blob/6888/1709268a24e491653dd045487a5de829/f-mureithi-data.jpg"}]}]