[{"id":3985378,"title":"Justin Muturi quits DP leadership to take up Attorney-General job","excerpt":"Justin Muturi quits DP leadership to take up Attorney-General job","body":"<p>Attorney-General nominee Justin Muturi has officially resigned as party leader of Democratic Party (DP) allowing him to take over the key state job.</p><p>In a letter dated October 11, 2022, which was addressed to the party’s National Management Committee (NMC) and copied to the Registrar of Political Parties Anne Nderitu, Mr Muturi says that following <a href=\"https://nation.africa/kenya/news/justin-muturi-from-speaker-to-kenya-s-next-attorney-general-3964324\" target=\"_blank\" rel=\"noopener\">his nomination as the government's legal adviso</a>r, he has relinquished his position as DP party boss. </p><p>He argues that for the sake of his vetting which will take place on Monday by the National Assembly’s Committee of Appointments.</p><p>“As you may be aware, the President of the Republic of Kenya and Commander in Chief of the Defence Forces has nominated me for appointment to the Office of the Attorney General pursuant to Article 156 of the Constitution. Article 77 (2) of the Constitution requires, inter alia, that appointed State Officers shall not hold an office in a political party. Subsequently, and to enable me to submit myself to approval consideration by the National Assembly, it is necessary to relinquish my position as party leader, which I hereby do, with effect from the date of this letter,” said Mr Muturi.</p><p>Mr Muturi had suggested that to fill the leadership vacuum, the party’s top brass to appoint Mbeere North MP George Kiringa in an acting capacity. But the party’s National Executive Council (NEC), which sat down on Thursday, decided to pick its patron Joseph Munyao to serve until next year when it will conduct elections.</p><p>“We are grateful to President William Ruto for honouring us with the position of Attorney-General. We are humbled by the gesture because he has fulfilled his promise. Following the resignation of Justin Muturi who was our party leader, the NEC in its meeting decided to hand over the position to our patron because it is always left for a person who can be a presidential or governor candidate,” DP chairman Esau Kioni told the <em>Nation</em>.</p><p>Only the President, Deputy President and MPs are exempted by the law since they are elected through universal suffrage.</p><p>“A full-time State officer shall not participate in any other gainful employment. Any appointed State officer shall not hold office in a political party,” reads Article 77 (1, 2) of the Constitution.</p><p>The constitutional provision is also set to affect Amani National Congress (ANC) leader Musalia Mudavadi, Maendeleo Chap Chap’s Alfred Mutua and Eliud Owalo, the deputy secretary-general of UDA.</p><p>Cabinet nominee for Trade and Industry, Moses Kuria has officially kicked off the process of merging his CCK party with President William Ruto's UDA.</p><p>Read: <a href=\"https://nation.africa/kenya/news/ruto-recalls-moi-s-staff-cars-and-guards-from-kabarak-3984352\" target=\"_blank\" rel=\"noopener\">Ruto recalls Moi's cars and staff</a></p><p><a href=\"https://nation.africa/kenya/news/ruto-officially-dumps-pscu-makes-far-reaching-changes-to-media-team-3985142\" target=\"_blank\" rel=\"noopener\">Ruto officially dumps PSCU, makes far-reaching changes to media team</a></p><p><em>onyangokonyango@gmail.com</em></p>","link":"https://nation.africa/kenya/news/politics/justin-muturi-quits-dp-leadership-to-take-up-attorney-general-job-3985378","slug":"Justin-Muturi-quits-DP-leadership-to-take-up-Attorney-General-job","date":"2022-10-14T13:45:42Z","articleDate":"14 Oct, 2022","timeAgo":"27 minutes ago","tags":["Kenya"," Politics"," Governance"," Justin Muturi"," quits DP","Attorney-General job"," vetting"," dp"],"photo":"https://nation.africa/resource/blob/3985396/9627e78bef639725b4d601a583d99b6e/justin-muturi-photo-data.jpg","caption":"","video":"","author":[{"fullname":"Onyango K'Onyango","biography":"","link":"https://nation.africa/kenya/news/politics/onyango-k-onyango-1911206","photo":"https://nation.africa/resource/blob/2305944/810fd1e655b14424cf1e580a98a7aa83/whatsapp-image-2020-09-22-at-13-20-40-data.jpg"}]},{"id":3985306,"title":"Women's sisterhood in Ruto's reign: Fulfil promises or we meet in 2027","excerpt":"Women's sisterhood in Ruto's reign: Fulfil promises or we meet in 2027","body":"<p>To President William Ruto’s name are nine promises to women of Kenya, detailed in the Kenya Kwanza manifesto and enhanced in the alliance’s Women Charter.</p><p>Already, he has broken his pledge of having women constitute half of his cabinet.</p><p>Of the 21 nominees announced last September, only seven were women, against the possible 10 going by his campaign commitment.</p><p>He, however, designated three women to equally top positions in his government namely Monica Juma (National Security Advisor), Harriet Chiggai (Women rights agency advisor), and Mercy Wanjau (Secretary to the Cabinet).</p><p>But women have vowed to unite in putting him on the radar of his promises until he delivers on each.</p><p>Of encouragement, is Dr Ruto and his Deputy Rigathi Gachagua’s openness to criticism.</p><h2>Flowers</h2><p>Both have repeatedly said their administration would be inclusive and receptive to critique, considering it as a propeller to meeting all their campaign promises.</p><p>Most sticky is the enactment of the two-thirds gender law, which for the past 12 years, has taken bitter and painful twists and turns.</p><p>From foiled attempts to approve the proposed laws in Parliament, which were also preceded by intensive lobbying of women legislators who at some point bought men legislators dinner and bouquet of flowers.</p><p>Civil societies went to court and the favourable rulings yielded nothing. An advisory by the reigning Chief Justice to dissolve Parliament never materialised.</p><p>In his manifesto, Dr Ruto committed to implementing the two-thirds gender rule in elective and appointive positions in the public sector, within 12 months after the elections.</p><p>But when he launched and signed the Women Charter in June, he reduced the timeframe.</p><h2>Hustlers' Fund</h2><p>He said: “Within three months of the Kenya Kwanza rule, we will put a mechanism to actualize the two-third gender rule and immediately operationalize that mechanism so that women don’t have to wait longer.”</p><p>In his five years, he will also have to account for his promise to distribute pads to all schools and public washrooms, ensure women access 50 per cent of the Sh50 billion Hustlers' Fund, tackle sexual and gender-based violence, and support the fight against female genital mutilation.</p><p>Well, to remind him of his promises will be the women leaders not only in political leadership but also in civil society.</p><p>On Wednesday, during a Journalists for Human Rights forum of media, women legislators and candidates in 2022 elections, and civil society, the women committed to working together regardless of their political affiliations in holding Ruto and Gachagua’s administration accountable.</p><p>“We must hold the President to account for his commitments. If he doesn’t (deliver on them, then), he will meet us in 2027,” said Gladys Shollei, the Deputy Speaker in the National Assembly.</p><p>Community Advocacy and Awareness Trust Executive Director, Daisy Amdany, said women must push for their agenda in a collective voice.</p><h2>Media</h2><p>“We are counting on you women in Parliament to pass proper laws on women,” she said.</p><p>As National Assembly and Senate plan to constitute their committees, Ms Amdany urged the Kenya Women Parliamentary Association to lobby for women to chair the respective committees.</p><p>Committees have the power to summon sitting Cabinet Secretaries to question them over failed promises or projects.</p><p>Meanwhile, Sammy Muraya, Project Manager at JHR said the media is an ally in advancing the rights of women and girls in Kenya.</p><p>Hence, he said, \"women parliamentarians should create a rapport with the media to amplify their voices and showcase their work.\"</p><p><br/></p><p><em> mobiria@ke.nationmedia.com</em></p>","link":"https://nation.africa/kenya/news/gender/women-s-sisterhood-in-ruto-s-reign-fulfil-promises-or-we-meet-in-2027-3985306","slug":"Women's-sisterhood-in-Ruto's-reign:-Fulfil-promises-or-we-meet-in-2027","date":"2022-10-14T12:50:09Z","articleDate":"14 Oct, 2022","timeAgo":"about 1 hour ago","tags":["Kenya"," Gender"," Court"," Law"," Sex"," pads"," gender based violence"," Elections"," Parliamentary"," Senate"," William Ruto"," Rigathi Gachagua"," MORAA OBIRIA"," Ruto promises"," UDA manifesto"," Monica Juma"," Harriet Chiggai"," Mercy Wanjau"," Gladys Boss Shollei"," Community Advocacy and Awareness Trust"," Daisy Amdany"," Sammy Muraya"],"photo":"https://nation.africa/resource/blob/3985308/7cbae1f4bccc9f9763b8ae76b4173862/shollei-pic-data.jpg","caption":"","video":"","author":[{"fullname":"Moraa Obiria","biography":"","link":"https://nation.africa/kenya/moraa-obiria-222848","photo":"https://nation.africa/resource/blob/222850/a84077fdebe01c1f61deac643bf02e5a/moraa-pic-data.jpg"}]}]